def area_rectangle(a, b):
    '''
    Возвращает площадь четырёхугольника

        Параметры: 
            a (int): первое десятичное число
            b (int): второе десятичное число

        Возвращаемое значение: десятичное число произведения a и b

    '''
    return a * b 

def perimeter_rectangle(a, b):
    '''
    Возвращает периметр четырёхугольника

        Параметры: 
            a (int): первое десятичное число
            b (int): второе десятичное число

        Возвращаемое значение: десятичное число

    ''' 
    return 2*(a + b)